Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 320, 320, 64) 640         input_2[0][0]                    
__________________________________________________________________________________________________
re_lu (ReLU)                    (None, 320, 320, 64) 0           conv2d[0][0]                     
__________________________________________________________________________________________________
instance_normalization (Instanc (None, 320, 320, 64) 128         re_lu[0][0]                      
__________________________________________________________________________________________________
dropout (Dropout)               (None, 320, 320, 64) 0           instance_normalization[0][0]     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 320, 320, 64) 36928       dropout[0][0]                    
__________________________________________________________________________________________________
re_lu_1 (ReLU)                  (None, 320, 320, 64) 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
instance_normalization_1 (Insta (None, 320, 320, 64) 128         re_lu_1[0][0]                    
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 320, 320, 64) 0           instance_normalization_1[0][0]   
__________________________________________________________________________________________________
max_pooling2d (MaxPooling2D)    (None, 160, 160, 64) 0           dropout_1[0][0]                  
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 160, 160, 128 73856       max_pooling2d[0][0]              
__________________________________________________________________________________________________
re_lu_2 (ReLU)                  (None, 160, 160, 128 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
instance_normalization_2 (Insta (None, 160, 160, 128 256         re_lu_2[0][0]                    
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 160, 160, 128 0           instance_normalization_2[0][0]   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 160, 160, 128 147584      dropout_2[0][0]                  
__________________________________________________________________________________________________
re_lu_3 (ReLU)                  (None, 160, 160, 128 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
instance_normalization_3 (Insta (None, 160, 160, 128 256         re_lu_3[0][0]                    
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 160, 160, 128 0           instance_normalization_3[0][0]   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 80, 80, 128)  0           dropout_3[0][0]                  
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 80, 80, 256)  295168      max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
re_lu_4 (ReLU)                  (None, 80, 80, 256)  0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
instance_normalization_4 (Insta (None, 80, 80, 256)  512         re_lu_4[0][0]                    
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 80, 80, 256)  0           instance_normalization_4[0][0]   
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 80, 80, 256)  590080      dropout_4[0][0]                  
__________________________________________________________________________________________________
re_lu_5 (ReLU)                  (None, 80, 80, 256)  0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
instance_normalization_5 (Insta (None, 80, 80, 256)  512         re_lu_5[0][0]                    
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 80, 80, 256)  0           instance_normalization_5[0][0]   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 40, 40, 256)  0           dropout_5[0][0]                  
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 40, 40, 512)  1180160     max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
re_lu_6 (ReLU)                  (None, 40, 40, 512)  0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
instance_normalization_6 (Insta (None, 40, 40, 512)  1024        re_lu_6[0][0]                    
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 40, 40, 512)  0           instance_normalization_6[0][0]   
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 40, 40, 512)  2359808     dropout_6[0][0]                  
__________________________________________________________________________________________________
re_lu_7 (ReLU)                  (None, 40, 40, 512)  0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
instance_normalization_7 (Insta (None, 40, 40, 512)  1024        re_lu_7[0][0]                    
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 40, 40, 512)  0           instance_normalization_7[0][0]   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 20, 20, 512)  0           dropout_7[0][0]                  
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 20, 20, 512)  2359808     max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
re_lu_8 (ReLU)                  (None, 20, 20, 512)  0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
instance_normalization_8 (Insta (None, 20, 20, 512)  1024        re_lu_8[0][0]                    
__________________________________________________________________________________________________
dropout_8 (Dropout)             (None, 20, 20, 512)  0           instance_normalization_8[0][0]   
__________________________________________________________________________________________________
up_sampling2d (UpSampling2D)    (None, 40, 40, 512)  0           dropout_8[0][0]                  
__________________________________________________________________________________________________
concatenate (Concatenate)       (None, 40, 40, 1024) 0           dropout_7[0][0]                  
                                                                 up_sampling2d[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 40, 40, 256)  2359552     concatenate[0][0]                
__________________________________________________________________________________________________
re_lu_9 (ReLU)                  (None, 40, 40, 256)  0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
instance_normalization_9 (Insta (None, 40, 40, 256)  512         re_lu_9[0][0]                    
__________________________________________________________________________________________________
dropout_9 (Dropout)             (None, 40, 40, 256)  0           instance_normalization_9[0][0]   
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 40, 40, 256)  590080      dropout_9[0][0]                  
__________________________________________________________________________________________________
re_lu_10 (ReLU)                 (None, 40, 40, 256)  0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
instance_normalization_10 (Inst (None, 40, 40, 256)  512         re_lu_10[0][0]                   
__________________________________________________________________________________________________
dropout_10 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_10[0][0]  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, 80, 80, 256)  0           dropout_10[0][0]                 
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 80, 80, 512)  0           dropout_5[0][0]                  
                                                                 up_sampling2d_1[0][0]            
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 80, 80, 128)  589952      concatenate_1[0][0]              
__________________________________________________________________________________________________
re_lu_11 (ReLU)                 (None, 80, 80, 128)  0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
instance_normalization_11 (Inst (None, 80, 80, 128)  256         re_lu_11[0][0]                   
__________________________________________________________________________________________________
dropout_11 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_11[0][0]  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 80, 80, 128)  147584      dropout_11[0][0]                 
__________________________________________________________________________________________________
re_lu_12 (ReLU)                 (None, 80, 80, 128)  0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
instance_normalization_12 (Inst (None, 80, 80, 128)  256         re_lu_12[0][0]                   
__________________________________________________________________________________________________
dropout_12 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_12[0][0]  
__________________________________________________________________________________________________
up_sampling2d_2 (UpSampling2D)  (None, 160, 160, 128 0           dropout_12[0][0]                 
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 160, 160, 256 0           dropout_3[0][0]                  
                                                                 up_sampling2d_2[0][0]            
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 160, 160, 64) 147520      concatenate_2[0][0]              
__________________________________________________________________________________________________
re_lu_13 (ReLU)                 (None, 160, 160, 64) 0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
instance_normalization_13 (Inst (None, 160, 160, 64) 128         re_lu_13[0][0]                   
__________________________________________________________________________________________________
dropout_13 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_13[0][0]  
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 160, 160, 64) 36928       dropout_13[0][0]                 
__________________________________________________________________________________________________
re_lu_14 (ReLU)                 (None, 160, 160, 64) 0           conv2d_14[0][0]                  
__________________________________________________________________________________________________
instance_normalization_14 (Inst (None, 160, 160, 64) 128         re_lu_14[0][0]                   
__________________________________________________________________________________________________
dropout_14 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_14[0][0]  
__________________________________________________________________________________________________
up_sampling2d_3 (UpSampling2D)  (None, 320, 320, 64) 0           dropout_14[0][0]                 
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 320, 320, 128 0           dropout_1[0][0]                  
                                                                 up_sampling2d_3[0][0]            
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 320, 320, 64) 73792       concatenate_3[0][0]              
__________________________________________________________________________________________________
re_lu_15 (ReLU)                 (None, 320, 320, 64) 0           conv2d_15[0][0]                  
__________________________________________________________________________________________________
instance_normalization_15 (Inst (None, 320, 320, 64) 128         re_lu_15[0][0]                   
__________________________________________________________________________________________________
dropout_15 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_15[0][0]  
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 320, 320, 64) 36928       dropout_15[0][0]                 
__________________________________________________________________________________________________
re_lu_16 (ReLU)                 (None, 320, 320, 64) 0           conv2d_16[0][0]                  
__________________________________________________________________________________________________
instance_normalization_16 (Inst (None, 320, 320, 64) 128         re_lu_16[0][0]                   
__________________________________________________________________________________________________
dropout_16 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_16[0][0]  
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 320, 320, 32) 2080        dropout_16[0][0]                 
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 320, 320, 1)  33          conv2d_17[0][0]                  
==================================================================================================
Total params: 11,035,393
Trainable params: 11,035,393
Non-trainable params: 0
__________________________________________________________________________________________________
