Model: "functional_5"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_6 (InputLayer)            [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_38 (Conv2D)              (None, 320, 320, 32) 320         input_6[0][0]                    
__________________________________________________________________________________________________
re_lu_34 (ReLU)                 (None, 320, 320, 32) 0           conv2d_38[0][0]                  
__________________________________________________________________________________________________
instance_normalization_34 (Inst (None, 320, 320, 32) 64          re_lu_34[0][0]                   
__________________________________________________________________________________________________
dropout_34 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_34[0][0]  
__________________________________________________________________________________________________
conv2d_39 (Conv2D)              (None, 320, 320, 32) 9248        dropout_34[0][0]                 
__________________________________________________________________________________________________
re_lu_35 (ReLU)                 (None, 320, 320, 32) 0           conv2d_39[0][0]                  
__________________________________________________________________________________________________
instance_normalization_35 (Inst (None, 320, 320, 32) 64          re_lu_35[0][0]                   
__________________________________________________________________________________________________
dropout_35 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_35[0][0]  
__________________________________________________________________________________________________
max_pooling2d_8 (MaxPooling2D)  (None, 160, 160, 32) 0           dropout_35[0][0]                 
__________________________________________________________________________________________________
conv2d_40 (Conv2D)              (None, 160, 160, 64) 18496       max_pooling2d_8[0][0]            
__________________________________________________________________________________________________
re_lu_36 (ReLU)                 (None, 160, 160, 64) 0           conv2d_40[0][0]                  
__________________________________________________________________________________________________
instance_normalization_36 (Inst (None, 160, 160, 64) 128         re_lu_36[0][0]                   
__________________________________________________________________________________________________
dropout_36 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_36[0][0]  
__________________________________________________________________________________________________
conv2d_41 (Conv2D)              (None, 160, 160, 64) 36928       dropout_36[0][0]                 
__________________________________________________________________________________________________
re_lu_37 (ReLU)                 (None, 160, 160, 64) 0           conv2d_41[0][0]                  
__________________________________________________________________________________________________
instance_normalization_37 (Inst (None, 160, 160, 64) 128         re_lu_37[0][0]                   
__________________________________________________________________________________________________
dropout_37 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_37[0][0]  
__________________________________________________________________________________________________
max_pooling2d_9 (MaxPooling2D)  (None, 80, 80, 64)   0           dropout_37[0][0]                 
__________________________________________________________________________________________________
conv2d_42 (Conv2D)              (None, 80, 80, 128)  73856       max_pooling2d_9[0][0]            
__________________________________________________________________________________________________
re_lu_38 (ReLU)                 (None, 80, 80, 128)  0           conv2d_42[0][0]                  
__________________________________________________________________________________________________
instance_normalization_38 (Inst (None, 80, 80, 128)  256         re_lu_38[0][0]                   
__________________________________________________________________________________________________
dropout_38 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_38[0][0]  
__________________________________________________________________________________________________
conv2d_43 (Conv2D)              (None, 80, 80, 128)  147584      dropout_38[0][0]                 
__________________________________________________________________________________________________
re_lu_39 (ReLU)                 (None, 80, 80, 128)  0           conv2d_43[0][0]                  
__________________________________________________________________________________________________
instance_normalization_39 (Inst (None, 80, 80, 128)  256         re_lu_39[0][0]                   
__________________________________________________________________________________________________
dropout_39 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_39[0][0]  
__________________________________________________________________________________________________
max_pooling2d_10 (MaxPooling2D) (None, 40, 40, 128)  0           dropout_39[0][0]                 
__________________________________________________________________________________________________
conv2d_44 (Conv2D)              (None, 40, 40, 256)  295168      max_pooling2d_10[0][0]           
__________________________________________________________________________________________________
re_lu_40 (ReLU)                 (None, 40, 40, 256)  0           conv2d_44[0][0]                  
__________________________________________________________________________________________________
instance_normalization_40 (Inst (None, 40, 40, 256)  512         re_lu_40[0][0]                   
__________________________________________________________________________________________________
dropout_40 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_40[0][0]  
__________________________________________________________________________________________________
conv2d_45 (Conv2D)              (None, 40, 40, 256)  590080      dropout_40[0][0]                 
__________________________________________________________________________________________________
re_lu_41 (ReLU)                 (None, 40, 40, 256)  0           conv2d_45[0][0]                  
__________________________________________________________________________________________________
instance_normalization_41 (Inst (None, 40, 40, 256)  512         re_lu_41[0][0]                   
__________________________________________________________________________________________________
dropout_41 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_41[0][0]  
__________________________________________________________________________________________________
max_pooling2d_11 (MaxPooling2D) (None, 20, 20, 256)  0           dropout_41[0][0]                 
__________________________________________________________________________________________________
conv2d_46 (Conv2D)              (None, 20, 20, 256)  590080      max_pooling2d_11[0][0]           
__________________________________________________________________________________________________
re_lu_42 (ReLU)                 (None, 20, 20, 256)  0           conv2d_46[0][0]                  
__________________________________________________________________________________________________
instance_normalization_42 (Inst (None, 20, 20, 256)  512         re_lu_42[0][0]                   
__________________________________________________________________________________________________
dropout_42 (Dropout)            (None, 20, 20, 256)  0           instance_normalization_42[0][0]  
__________________________________________________________________________________________________
up_sampling2d_8 (UpSampling2D)  (None, 40, 40, 256)  0           dropout_42[0][0]                 
__________________________________________________________________________________________________
concatenate_8 (Concatenate)     (None, 40, 40, 512)  0           dropout_41[0][0]                 
                                                                 up_sampling2d_8[0][0]            
__________________________________________________________________________________________________
conv2d_47 (Conv2D)              (None, 40, 40, 128)  589952      concatenate_8[0][0]              
__________________________________________________________________________________________________
re_lu_43 (ReLU)                 (None, 40, 40, 128)  0           conv2d_47[0][0]                  
__________________________________________________________________________________________________
instance_normalization_43 (Inst (None, 40, 40, 128)  256         re_lu_43[0][0]                   
__________________________________________________________________________________________________
dropout_43 (Dropout)            (None, 40, 40, 128)  0           instance_normalization_43[0][0]  
__________________________________________________________________________________________________
conv2d_48 (Conv2D)              (None, 40, 40, 128)  147584      dropout_43[0][0]                 
__________________________________________________________________________________________________
re_lu_44 (ReLU)                 (None, 40, 40, 128)  0           conv2d_48[0][0]                  
__________________________________________________________________________________________________
instance_normalization_44 (Inst (None, 40, 40, 128)  256         re_lu_44[0][0]                   
__________________________________________________________________________________________________
dropout_44 (Dropout)            (None, 40, 40, 128)  0           instance_normalization_44[0][0]  
__________________________________________________________________________________________________
up_sampling2d_9 (UpSampling2D)  (None, 80, 80, 128)  0           dropout_44[0][0]                 
__________________________________________________________________________________________________
concatenate_9 (Concatenate)     (None, 80, 80, 256)  0           dropout_39[0][0]                 
                                                                 up_sampling2d_9[0][0]            
__________________________________________________________________________________________________
conv2d_49 (Conv2D)              (None, 80, 80, 64)   147520      concatenate_9[0][0]              
__________________________________________________________________________________________________
re_lu_45 (ReLU)                 (None, 80, 80, 64)   0           conv2d_49[0][0]                  
__________________________________________________________________________________________________
instance_normalization_45 (Inst (None, 80, 80, 64)   128         re_lu_45[0][0]                   
__________________________________________________________________________________________________
dropout_45 (Dropout)            (None, 80, 80, 64)   0           instance_normalization_45[0][0]  
__________________________________________________________________________________________________
conv2d_50 (Conv2D)              (None, 80, 80, 64)   36928       dropout_45[0][0]                 
__________________________________________________________________________________________________
re_lu_46 (ReLU)                 (None, 80, 80, 64)   0           conv2d_50[0][0]                  
__________________________________________________________________________________________________
instance_normalization_46 (Inst (None, 80, 80, 64)   128         re_lu_46[0][0]                   
__________________________________________________________________________________________________
dropout_46 (Dropout)            (None, 80, 80, 64)   0           instance_normalization_46[0][0]  
__________________________________________________________________________________________________
up_sampling2d_10 (UpSampling2D) (None, 160, 160, 64) 0           dropout_46[0][0]                 
__________________________________________________________________________________________________
concatenate_10 (Concatenate)    (None, 160, 160, 128 0           dropout_37[0][0]                 
                                                                 up_sampling2d_10[0][0]           
__________________________________________________________________________________________________
conv2d_51 (Conv2D)              (None, 160, 160, 32) 36896       concatenate_10[0][0]             
__________________________________________________________________________________________________
re_lu_47 (ReLU)                 (None, 160, 160, 32) 0           conv2d_51[0][0]                  
__________________________________________________________________________________________________
instance_normalization_47 (Inst (None, 160, 160, 32) 64          re_lu_47[0][0]                   
__________________________________________________________________________________________________
dropout_47 (Dropout)            (None, 160, 160, 32) 0           instance_normalization_47[0][0]  
__________________________________________________________________________________________________
conv2d_52 (Conv2D)              (None, 160, 160, 32) 9248        dropout_47[0][0]                 
__________________________________________________________________________________________________
re_lu_48 (ReLU)                 (None, 160, 160, 32) 0           conv2d_52[0][0]                  
__________________________________________________________________________________________________
instance_normalization_48 (Inst (None, 160, 160, 32) 64          re_lu_48[0][0]                   
__________________________________________________________________________________________________
dropout_48 (Dropout)            (None, 160, 160, 32) 0           instance_normalization_48[0][0]  
__________________________________________________________________________________________________
up_sampling2d_11 (UpSampling2D) (None, 320, 320, 32) 0           dropout_48[0][0]                 
__________________________________________________________________________________________________
concatenate_11 (Concatenate)    (None, 320, 320, 64) 0           dropout_35[0][0]                 
                                                                 up_sampling2d_11[0][0]           
__________________________________________________________________________________________________
conv2d_53 (Conv2D)              (None, 320, 320, 32) 18464       concatenate_11[0][0]             
__________________________________________________________________________________________________
re_lu_49 (ReLU)                 (None, 320, 320, 32) 0           conv2d_53[0][0]                  
__________________________________________________________________________________________________
instance_normalization_49 (Inst (None, 320, 320, 32) 64          re_lu_49[0][0]                   
__________________________________________________________________________________________________
dropout_49 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_49[0][0]  
__________________________________________________________________________________________________
conv2d_54 (Conv2D)              (None, 320, 320, 32) 9248        dropout_49[0][0]                 
__________________________________________________________________________________________________
re_lu_50 (ReLU)                 (None, 320, 320, 32) 0           conv2d_54[0][0]                  
__________________________________________________________________________________________________
instance_normalization_50 (Inst (None, 320, 320, 32) 64          re_lu_50[0][0]                   
__________________________________________________________________________________________________
dropout_50 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_50[0][0]  
__________________________________________________________________________________________________
conv2d_55 (Conv2D)              (None, 320, 320, 16) 528         dropout_50[0][0]                 
__________________________________________________________________________________________________
conv2d_56 (Conv2D)              (None, 320, 320, 1)  17          conv2d_55[0][0]                  
==================================================================================================
Total params: 2,761,601
Trainable params: 2,761,601
Non-trainable params: 0
__________________________________________________________________________________________________
