Model: "functional_3"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_4 (InputLayer)            [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 320, 320, 64) 640         input_4[0][0]                    
__________________________________________________________________________________________________
re_lu_17 (ReLU)                 (None, 320, 320, 64) 0           conv2d_19[0][0]                  
__________________________________________________________________________________________________
instance_normalization_17 (Inst (None, 320, 320, 64) 128         re_lu_17[0][0]                   
__________________________________________________________________________________________________
dropout_17 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_17[0][0]  
__________________________________________________________________________________________________
conv2d_20 (Conv2D)              (None, 320, 320, 64) 36928       dropout_17[0][0]                 
__________________________________________________________________________________________________
re_lu_18 (ReLU)                 (None, 320, 320, 64) 0           conv2d_20[0][0]                  
__________________________________________________________________________________________________
instance_normalization_18 (Inst (None, 320, 320, 64) 128         re_lu_18[0][0]                   
__________________________________________________________________________________________________
dropout_18 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_18[0][0]  
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 160, 160, 64) 0           dropout_18[0][0]                 
__________________________________________________________________________________________________
conv2d_21 (Conv2D)              (None, 160, 160, 128 73856       max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
re_lu_19 (ReLU)                 (None, 160, 160, 128 0           conv2d_21[0][0]                  
__________________________________________________________________________________________________
instance_normalization_19 (Inst (None, 160, 160, 128 256         re_lu_19[0][0]                   
__________________________________________________________________________________________________
dropout_19 (Dropout)            (None, 160, 160, 128 0           instance_normalization_19[0][0]  
__________________________________________________________________________________________________
conv2d_22 (Conv2D)              (None, 160, 160, 128 147584      dropout_19[0][0]                 
__________________________________________________________________________________________________
re_lu_20 (ReLU)                 (None, 160, 160, 128 0           conv2d_22[0][0]                  
__________________________________________________________________________________________________
instance_normalization_20 (Inst (None, 160, 160, 128 256         re_lu_20[0][0]                   
__________________________________________________________________________________________________
dropout_20 (Dropout)            (None, 160, 160, 128 0           instance_normalization_20[0][0]  
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 80, 80, 128)  0           dropout_20[0][0]                 
__________________________________________________________________________________________________
conv2d_23 (Conv2D)              (None, 80, 80, 256)  295168      max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
re_lu_21 (ReLU)                 (None, 80, 80, 256)  0           conv2d_23[0][0]                  
__________________________________________________________________________________________________
instance_normalization_21 (Inst (None, 80, 80, 256)  512         re_lu_21[0][0]                   
__________________________________________________________________________________________________
dropout_21 (Dropout)            (None, 80, 80, 256)  0           instance_normalization_21[0][0]  
__________________________________________________________________________________________________
conv2d_24 (Conv2D)              (None, 80, 80, 256)  590080      dropout_21[0][0]                 
__________________________________________________________________________________________________
re_lu_22 (ReLU)                 (None, 80, 80, 256)  0           conv2d_24[0][0]                  
__________________________________________________________________________________________________
instance_normalization_22 (Inst (None, 80, 80, 256)  512         re_lu_22[0][0]                   
__________________________________________________________________________________________________
dropout_22 (Dropout)            (None, 80, 80, 256)  0           instance_normalization_22[0][0]  
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, 40, 40, 256)  0           dropout_22[0][0]                 
__________________________________________________________________________________________________
conv2d_25 (Conv2D)              (None, 40, 40, 512)  1180160     max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
re_lu_23 (ReLU)                 (None, 40, 40, 512)  0           conv2d_25[0][0]                  
__________________________________________________________________________________________________
instance_normalization_23 (Inst (None, 40, 40, 512)  1024        re_lu_23[0][0]                   
__________________________________________________________________________________________________
dropout_23 (Dropout)            (None, 40, 40, 512)  0           instance_normalization_23[0][0]  
__________________________________________________________________________________________________
conv2d_26 (Conv2D)              (None, 40, 40, 512)  2359808     dropout_23[0][0]                 
__________________________________________________________________________________________________
re_lu_24 (ReLU)                 (None, 40, 40, 512)  0           conv2d_26[0][0]                  
__________________________________________________________________________________________________
instance_normalization_24 (Inst (None, 40, 40, 512)  1024        re_lu_24[0][0]                   
__________________________________________________________________________________________________
dropout_24 (Dropout)            (None, 40, 40, 512)  0           instance_normalization_24[0][0]  
__________________________________________________________________________________________________
max_pooling2d_7 (MaxPooling2D)  (None, 20, 20, 512)  0           dropout_24[0][0]                 
__________________________________________________________________________________________________
conv2d_27 (Conv2D)              (None, 20, 20, 512)  2359808     max_pooling2d_7[0][0]            
__________________________________________________________________________________________________
re_lu_25 (ReLU)                 (None, 20, 20, 512)  0           conv2d_27[0][0]                  
__________________________________________________________________________________________________
instance_normalization_25 (Inst (None, 20, 20, 512)  1024        re_lu_25[0][0]                   
__________________________________________________________________________________________________
dropout_25 (Dropout)            (None, 20, 20, 512)  0           instance_normalization_25[0][0]  
__________________________________________________________________________________________________
up_sampling2d_4 (UpSampling2D)  (None, 40, 40, 512)  0           dropout_25[0][0]                 
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 40, 40, 1024) 0           dropout_24[0][0]                 
                                                                 up_sampling2d_4[0][0]            
__________________________________________________________________________________________________
conv2d_28 (Conv2D)              (None, 40, 40, 256)  2359552     concatenate_4[0][0]              
__________________________________________________________________________________________________
re_lu_26 (ReLU)                 (None, 40, 40, 256)  0           conv2d_28[0][0]                  
__________________________________________________________________________________________________
instance_normalization_26 (Inst (None, 40, 40, 256)  512         re_lu_26[0][0]                   
__________________________________________________________________________________________________
dropout_26 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_26[0][0]  
__________________________________________________________________________________________________
conv2d_29 (Conv2D)              (None, 40, 40, 256)  590080      dropout_26[0][0]                 
__________________________________________________________________________________________________
re_lu_27 (ReLU)                 (None, 40, 40, 256)  0           conv2d_29[0][0]                  
__________________________________________________________________________________________________
instance_normalization_27 (Inst (None, 40, 40, 256)  512         re_lu_27[0][0]                   
__________________________________________________________________________________________________
dropout_27 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_27[0][0]  
__________________________________________________________________________________________________
up_sampling2d_5 (UpSampling2D)  (None, 80, 80, 256)  0           dropout_27[0][0]                 
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 80, 80, 512)  0           dropout_22[0][0]                 
                                                                 up_sampling2d_5[0][0]            
__________________________________________________________________________________________________
conv2d_30 (Conv2D)              (None, 80, 80, 128)  589952      concatenate_5[0][0]              
__________________________________________________________________________________________________
re_lu_28 (ReLU)                 (None, 80, 80, 128)  0           conv2d_30[0][0]                  
__________________________________________________________________________________________________
instance_normalization_28 (Inst (None, 80, 80, 128)  256         re_lu_28[0][0]                   
__________________________________________________________________________________________________
dropout_28 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_28[0][0]  
__________________________________________________________________________________________________
conv2d_31 (Conv2D)              (None, 80, 80, 128)  147584      dropout_28[0][0]                 
__________________________________________________________________________________________________
re_lu_29 (ReLU)                 (None, 80, 80, 128)  0           conv2d_31[0][0]                  
__________________________________________________________________________________________________
instance_normalization_29 (Inst (None, 80, 80, 128)  256         re_lu_29[0][0]                   
__________________________________________________________________________________________________
dropout_29 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_29[0][0]  
__________________________________________________________________________________________________
up_sampling2d_6 (UpSampling2D)  (None, 160, 160, 128 0           dropout_29[0][0]                 
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 160, 160, 256 0           dropout_20[0][0]                 
                                                                 up_sampling2d_6[0][0]            
__________________________________________________________________________________________________
conv2d_32 (Conv2D)              (None, 160, 160, 64) 147520      concatenate_6[0][0]              
__________________________________________________________________________________________________
re_lu_30 (ReLU)                 (None, 160, 160, 64) 0           conv2d_32[0][0]                  
__________________________________________________________________________________________________
instance_normalization_30 (Inst (None, 160, 160, 64) 128         re_lu_30[0][0]                   
__________________________________________________________________________________________________
dropout_30 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_30[0][0]  
__________________________________________________________________________________________________
conv2d_33 (Conv2D)              (None, 160, 160, 64) 36928       dropout_30[0][0]                 
__________________________________________________________________________________________________
re_lu_31 (ReLU)                 (None, 160, 160, 64) 0           conv2d_33[0][0]                  
__________________________________________________________________________________________________
instance_normalization_31 (Inst (None, 160, 160, 64) 128         re_lu_31[0][0]                   
__________________________________________________________________________________________________
dropout_31 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_31[0][0]  
__________________________________________________________________________________________________
up_sampling2d_7 (UpSampling2D)  (None, 320, 320, 64) 0           dropout_31[0][0]                 
__________________________________________________________________________________________________
concatenate_7 (Concatenate)     (None, 320, 320, 128 0           dropout_18[0][0]                 
                                                                 up_sampling2d_7[0][0]            
__________________________________________________________________________________________________
conv2d_34 (Conv2D)              (None, 320, 320, 64) 73792       concatenate_7[0][0]              
__________________________________________________________________________________________________
re_lu_32 (ReLU)                 (None, 320, 320, 64) 0           conv2d_34[0][0]                  
__________________________________________________________________________________________________
instance_normalization_32 (Inst (None, 320, 320, 64) 128         re_lu_32[0][0]                   
__________________________________________________________________________________________________
dropout_32 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_32[0][0]  
__________________________________________________________________________________________________
conv2d_35 (Conv2D)              (None, 320, 320, 64) 36928       dropout_32[0][0]                 
__________________________________________________________________________________________________
re_lu_33 (ReLU)                 (None, 320, 320, 64) 0           conv2d_35[0][0]                  
__________________________________________________________________________________________________
instance_normalization_33 (Inst (None, 320, 320, 64) 128         re_lu_33[0][0]                   
__________________________________________________________________________________________________
dropout_33 (Dropout)            (None, 320, 320, 64) 0           instance_normalization_33[0][0]  
__________________________________________________________________________________________________
conv2d_36 (Conv2D)              (None, 320, 320, 32) 2080        dropout_33[0][0]                 
__________________________________________________________________________________________________
conv2d_37 (Conv2D)              (None, 320, 320, 1)  33          conv2d_36[0][0]                  
==================================================================================================
Total params: 11,035,393
Trainable params: 11,035,393
Non-trainable params: 0
__________________________________________________________________________________________________
