Model: "functional_9"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_10 (InputLayer)           [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_76 (Conv2D)              (None, 320, 320, 2)  20          input_10[0][0]                   
__________________________________________________________________________________________________
re_lu_68 (ReLU)                 (None, 320, 320, 2)  0           conv2d_76[0][0]                  
__________________________________________________________________________________________________
instance_normalization_68 (Inst (None, 320, 320, 2)  4           re_lu_68[0][0]                   
__________________________________________________________________________________________________
dropout_68 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_68[0][0]  
__________________________________________________________________________________________________
conv2d_77 (Conv2D)              (None, 320, 320, 2)  38          dropout_68[0][0]                 
__________________________________________________________________________________________________
re_lu_69 (ReLU)                 (None, 320, 320, 2)  0           conv2d_77[0][0]                  
__________________________________________________________________________________________________
instance_normalization_69 (Inst (None, 320, 320, 2)  4           re_lu_69[0][0]                   
__________________________________________________________________________________________________
dropout_69 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_69[0][0]  
__________________________________________________________________________________________________
max_pooling2d_16 (MaxPooling2D) (None, 160, 160, 2)  0           dropout_69[0][0]                 
__________________________________________________________________________________________________
conv2d_78 (Conv2D)              (None, 160, 160, 4)  76          max_pooling2d_16[0][0]           
__________________________________________________________________________________________________
re_lu_70 (ReLU)                 (None, 160, 160, 4)  0           conv2d_78[0][0]                  
__________________________________________________________________________________________________
instance_normalization_70 (Inst (None, 160, 160, 4)  8           re_lu_70[0][0]                   
__________________________________________________________________________________________________
dropout_70 (Dropout)            (None, 160, 160, 4)  0           instance_normalization_70[0][0]  
__________________________________________________________________________________________________
conv2d_79 (Conv2D)              (None, 160, 160, 4)  148         dropout_70[0][0]                 
__________________________________________________________________________________________________
re_lu_71 (ReLU)                 (None, 160, 160, 4)  0           conv2d_79[0][0]                  
__________________________________________________________________________________________________
instance_normalization_71 (Inst (None, 160, 160, 4)  8           re_lu_71[0][0]                   
__________________________________________________________________________________________________
dropout_71 (Dropout)            (None, 160, 160, 4)  0           instance_normalization_71[0][0]  
__________________________________________________________________________________________________
max_pooling2d_17 (MaxPooling2D) (None, 80, 80, 4)    0           dropout_71[0][0]                 
__________________________________________________________________________________________________
conv2d_80 (Conv2D)              (None, 80, 80, 8)    296         max_pooling2d_17[0][0]           
__________________________________________________________________________________________________
re_lu_72 (ReLU)                 (None, 80, 80, 8)    0           conv2d_80[0][0]                  
__________________________________________________________________________________________________
instance_normalization_72 (Inst (None, 80, 80, 8)    16          re_lu_72[0][0]                   
__________________________________________________________________________________________________
dropout_72 (Dropout)            (None, 80, 80, 8)    0           instance_normalization_72[0][0]  
__________________________________________________________________________________________________
conv2d_81 (Conv2D)              (None, 80, 80, 8)    584         dropout_72[0][0]                 
__________________________________________________________________________________________________
re_lu_73 (ReLU)                 (None, 80, 80, 8)    0           conv2d_81[0][0]                  
__________________________________________________________________________________________________
instance_normalization_73 (Inst (None, 80, 80, 8)    16          re_lu_73[0][0]                   
__________________________________________________________________________________________________
dropout_73 (Dropout)            (None, 80, 80, 8)    0           instance_normalization_73[0][0]  
__________________________________________________________________________________________________
max_pooling2d_18 (MaxPooling2D) (None, 40, 40, 8)    0           dropout_73[0][0]                 
__________________________________________________________________________________________________
conv2d_82 (Conv2D)              (None, 40, 40, 16)   1168        max_pooling2d_18[0][0]           
__________________________________________________________________________________________________
re_lu_74 (ReLU)                 (None, 40, 40, 16)   0           conv2d_82[0][0]                  
__________________________________________________________________________________________________
instance_normalization_74 (Inst (None, 40, 40, 16)   32          re_lu_74[0][0]                   
__________________________________________________________________________________________________
dropout_74 (Dropout)            (None, 40, 40, 16)   0           instance_normalization_74[0][0]  
__________________________________________________________________________________________________
conv2d_83 (Conv2D)              (None, 40, 40, 16)   2320        dropout_74[0][0]                 
__________________________________________________________________________________________________
re_lu_75 (ReLU)                 (None, 40, 40, 16)   0           conv2d_83[0][0]                  
__________________________________________________________________________________________________
instance_normalization_75 (Inst (None, 40, 40, 16)   32          re_lu_75[0][0]                   
__________________________________________________________________________________________________
dropout_75 (Dropout)            (None, 40, 40, 16)   0           instance_normalization_75[0][0]  
__________________________________________________________________________________________________
max_pooling2d_19 (MaxPooling2D) (None, 20, 20, 16)   0           dropout_75[0][0]                 
__________________________________________________________________________________________________
conv2d_84 (Conv2D)              (None, 20, 20, 16)   2320        max_pooling2d_19[0][0]           
__________________________________________________________________________________________________
re_lu_76 (ReLU)                 (None, 20, 20, 16)   0           conv2d_84[0][0]                  
__________________________________________________________________________________________________
instance_normalization_76 (Inst (None, 20, 20, 16)   32          re_lu_76[0][0]                   
__________________________________________________________________________________________________
dropout_76 (Dropout)            (None, 20, 20, 16)   0           instance_normalization_76[0][0]  
__________________________________________________________________________________________________
up_sampling2d_16 (UpSampling2D) (None, 40, 40, 16)   0           dropout_76[0][0]                 
__________________________________________________________________________________________________
concatenate_16 (Concatenate)    (None, 40, 40, 32)   0           dropout_75[0][0]                 
                                                                 up_sampling2d_16[0][0]           
__________________________________________________________________________________________________
conv2d_85 (Conv2D)              (None, 40, 40, 8)    2312        concatenate_16[0][0]             
__________________________________________________________________________________________________
re_lu_77 (ReLU)                 (None, 40, 40, 8)    0           conv2d_85[0][0]                  
__________________________________________________________________________________________________
instance_normalization_77 (Inst (None, 40, 40, 8)    16          re_lu_77[0][0]                   
__________________________________________________________________________________________________
dropout_77 (Dropout)            (None, 40, 40, 8)    0           instance_normalization_77[0][0]  
__________________________________________________________________________________________________
conv2d_86 (Conv2D)              (None, 40, 40, 8)    584         dropout_77[0][0]                 
__________________________________________________________________________________________________
re_lu_78 (ReLU)                 (None, 40, 40, 8)    0           conv2d_86[0][0]                  
__________________________________________________________________________________________________
instance_normalization_78 (Inst (None, 40, 40, 8)    16          re_lu_78[0][0]                   
__________________________________________________________________________________________________
dropout_78 (Dropout)            (None, 40, 40, 8)    0           instance_normalization_78[0][0]  
__________________________________________________________________________________________________
up_sampling2d_17 (UpSampling2D) (None, 80, 80, 8)    0           dropout_78[0][0]                 
__________________________________________________________________________________________________
concatenate_17 (Concatenate)    (None, 80, 80, 16)   0           dropout_73[0][0]                 
                                                                 up_sampling2d_17[0][0]           
__________________________________________________________________________________________________
conv2d_87 (Conv2D)              (None, 80, 80, 4)    580         concatenate_17[0][0]             
__________________________________________________________________________________________________
re_lu_79 (ReLU)                 (None, 80, 80, 4)    0           conv2d_87[0][0]                  
__________________________________________________________________________________________________
instance_normalization_79 (Inst (None, 80, 80, 4)    8           re_lu_79[0][0]                   
__________________________________________________________________________________________________
dropout_79 (Dropout)            (None, 80, 80, 4)    0           instance_normalization_79[0][0]  
__________________________________________________________________________________________________
conv2d_88 (Conv2D)              (None, 80, 80, 4)    148         dropout_79[0][0]                 
__________________________________________________________________________________________________
re_lu_80 (ReLU)                 (None, 80, 80, 4)    0           conv2d_88[0][0]                  
__________________________________________________________________________________________________
instance_normalization_80 (Inst (None, 80, 80, 4)    8           re_lu_80[0][0]                   
__________________________________________________________________________________________________
dropout_80 (Dropout)            (None, 80, 80, 4)    0           instance_normalization_80[0][0]  
__________________________________________________________________________________________________
up_sampling2d_18 (UpSampling2D) (None, 160, 160, 4)  0           dropout_80[0][0]                 
__________________________________________________________________________________________________
concatenate_18 (Concatenate)    (None, 160, 160, 8)  0           dropout_71[0][0]                 
                                                                 up_sampling2d_18[0][0]           
__________________________________________________________________________________________________
conv2d_89 (Conv2D)              (None, 160, 160, 2)  146         concatenate_18[0][0]             
__________________________________________________________________________________________________
re_lu_81 (ReLU)                 (None, 160, 160, 2)  0           conv2d_89[0][0]                  
__________________________________________________________________________________________________
instance_normalization_81 (Inst (None, 160, 160, 2)  4           re_lu_81[0][0]                   
__________________________________________________________________________________________________
dropout_81 (Dropout)            (None, 160, 160, 2)  0           instance_normalization_81[0][0]  
__________________________________________________________________________________________________
conv2d_90 (Conv2D)              (None, 160, 160, 2)  38          dropout_81[0][0]                 
__________________________________________________________________________________________________
re_lu_82 (ReLU)                 (None, 160, 160, 2)  0           conv2d_90[0][0]                  
__________________________________________________________________________________________________
instance_normalization_82 (Inst (None, 160, 160, 2)  4           re_lu_82[0][0]                   
__________________________________________________________________________________________________
dropout_82 (Dropout)            (None, 160, 160, 2)  0           instance_normalization_82[0][0]  
__________________________________________________________________________________________________
up_sampling2d_19 (UpSampling2D) (None, 320, 320, 2)  0           dropout_82[0][0]                 
__________________________________________________________________________________________________
concatenate_19 (Concatenate)    (None, 320, 320, 4)  0           dropout_69[0][0]                 
                                                                 up_sampling2d_19[0][0]           
__________________________________________________________________________________________________
conv2d_91 (Conv2D)              (None, 320, 320, 2)  74          concatenate_19[0][0]             
__________________________________________________________________________________________________
re_lu_83 (ReLU)                 (None, 320, 320, 2)  0           conv2d_91[0][0]                  
__________________________________________________________________________________________________
instance_normalization_83 (Inst (None, 320, 320, 2)  4           re_lu_83[0][0]                   
__________________________________________________________________________________________________
dropout_83 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_83[0][0]  
__________________________________________________________________________________________________
conv2d_92 (Conv2D)              (None, 320, 320, 2)  38          dropout_83[0][0]                 
__________________________________________________________________________________________________
re_lu_84 (ReLU)                 (None, 320, 320, 2)  0           conv2d_92[0][0]                  
__________________________________________________________________________________________________
instance_normalization_84 (Inst (None, 320, 320, 2)  4           re_lu_84[0][0]                   
__________________________________________________________________________________________________
dropout_84 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_84[0][0]  
__________________________________________________________________________________________________
conv2d_93 (Conv2D)              (None, 320, 320, 1)  3           dropout_84[0][0]                 
__________________________________________________________________________________________________
conv2d_94 (Conv2D)              (None, 320, 320, 1)  2           conv2d_93[0][0]                  
==================================================================================================
Total params: 11,111
Trainable params: 11,111
Non-trainable params: 0
__________________________________________________________________________________________________
