Model: "functional_7"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_8 (InputLayer)            [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_57 (Conv2D)              (None, 320, 320, 32) 320         input_8[0][0]                    
__________________________________________________________________________________________________
re_lu_51 (ReLU)                 (None, 320, 320, 32) 0           conv2d_57[0][0]                  
__________________________________________________________________________________________________
instance_normalization_51 (Inst (None, 320, 320, 32) 64          re_lu_51[0][0]                   
__________________________________________________________________________________________________
dropout_51 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_51[0][0]  
__________________________________________________________________________________________________
conv2d_58 (Conv2D)              (None, 320, 320, 32) 9248        dropout_51[0][0]                 
__________________________________________________________________________________________________
re_lu_52 (ReLU)                 (None, 320, 320, 32) 0           conv2d_58[0][0]                  
__________________________________________________________________________________________________
instance_normalization_52 (Inst (None, 320, 320, 32) 64          re_lu_52[0][0]                   
__________________________________________________________________________________________________
dropout_52 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_52[0][0]  
__________________________________________________________________________________________________
max_pooling2d_12 (MaxPooling2D) (None, 160, 160, 32) 0           dropout_52[0][0]                 
__________________________________________________________________________________________________
conv2d_59 (Conv2D)              (None, 160, 160, 64) 18496       max_pooling2d_12[0][0]           
__________________________________________________________________________________________________
re_lu_53 (ReLU)                 (None, 160, 160, 64) 0           conv2d_59[0][0]                  
__________________________________________________________________________________________________
instance_normalization_53 (Inst (None, 160, 160, 64) 128         re_lu_53[0][0]                   
__________________________________________________________________________________________________
dropout_53 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_53[0][0]  
__________________________________________________________________________________________________
conv2d_60 (Conv2D)              (None, 160, 160, 64) 36928       dropout_53[0][0]                 
__________________________________________________________________________________________________
re_lu_54 (ReLU)                 (None, 160, 160, 64) 0           conv2d_60[0][0]                  
__________________________________________________________________________________________________
instance_normalization_54 (Inst (None, 160, 160, 64) 128         re_lu_54[0][0]                   
__________________________________________________________________________________________________
dropout_54 (Dropout)            (None, 160, 160, 64) 0           instance_normalization_54[0][0]  
__________________________________________________________________________________________________
max_pooling2d_13 (MaxPooling2D) (None, 80, 80, 64)   0           dropout_54[0][0]                 
__________________________________________________________________________________________________
conv2d_61 (Conv2D)              (None, 80, 80, 128)  73856       max_pooling2d_13[0][0]           
__________________________________________________________________________________________________
re_lu_55 (ReLU)                 (None, 80, 80, 128)  0           conv2d_61[0][0]                  
__________________________________________________________________________________________________
instance_normalization_55 (Inst (None, 80, 80, 128)  256         re_lu_55[0][0]                   
__________________________________________________________________________________________________
dropout_55 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_55[0][0]  
__________________________________________________________________________________________________
conv2d_62 (Conv2D)              (None, 80, 80, 128)  147584      dropout_55[0][0]                 
__________________________________________________________________________________________________
re_lu_56 (ReLU)                 (None, 80, 80, 128)  0           conv2d_62[0][0]                  
__________________________________________________________________________________________________
instance_normalization_56 (Inst (None, 80, 80, 128)  256         re_lu_56[0][0]                   
__________________________________________________________________________________________________
dropout_56 (Dropout)            (None, 80, 80, 128)  0           instance_normalization_56[0][0]  
__________________________________________________________________________________________________
max_pooling2d_14 (MaxPooling2D) (None, 40, 40, 128)  0           dropout_56[0][0]                 
__________________________________________________________________________________________________
conv2d_63 (Conv2D)              (None, 40, 40, 256)  295168      max_pooling2d_14[0][0]           
__________________________________________________________________________________________________
re_lu_57 (ReLU)                 (None, 40, 40, 256)  0           conv2d_63[0][0]                  
__________________________________________________________________________________________________
instance_normalization_57 (Inst (None, 40, 40, 256)  512         re_lu_57[0][0]                   
__________________________________________________________________________________________________
dropout_57 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_57[0][0]  
__________________________________________________________________________________________________
conv2d_64 (Conv2D)              (None, 40, 40, 256)  590080      dropout_57[0][0]                 
__________________________________________________________________________________________________
re_lu_58 (ReLU)                 (None, 40, 40, 256)  0           conv2d_64[0][0]                  
__________________________________________________________________________________________________
instance_normalization_58 (Inst (None, 40, 40, 256)  512         re_lu_58[0][0]                   
__________________________________________________________________________________________________
dropout_58 (Dropout)            (None, 40, 40, 256)  0           instance_normalization_58[0][0]  
__________________________________________________________________________________________________
max_pooling2d_15 (MaxPooling2D) (None, 20, 20, 256)  0           dropout_58[0][0]                 
__________________________________________________________________________________________________
conv2d_65 (Conv2D)              (None, 20, 20, 256)  590080      max_pooling2d_15[0][0]           
__________________________________________________________________________________________________
re_lu_59 (ReLU)                 (None, 20, 20, 256)  0           conv2d_65[0][0]                  
__________________________________________________________________________________________________
instance_normalization_59 (Inst (None, 20, 20, 256)  512         re_lu_59[0][0]                   
__________________________________________________________________________________________________
dropout_59 (Dropout)            (None, 20, 20, 256)  0           instance_normalization_59[0][0]  
__________________________________________________________________________________________________
up_sampling2d_12 (UpSampling2D) (None, 40, 40, 256)  0           dropout_59[0][0]                 
__________________________________________________________________________________________________
concatenate_12 (Concatenate)    (None, 40, 40, 512)  0           dropout_58[0][0]                 
                                                                 up_sampling2d_12[0][0]           
__________________________________________________________________________________________________
conv2d_66 (Conv2D)              (None, 40, 40, 128)  589952      concatenate_12[0][0]             
__________________________________________________________________________________________________
re_lu_60 (ReLU)                 (None, 40, 40, 128)  0           conv2d_66[0][0]                  
__________________________________________________________________________________________________
instance_normalization_60 (Inst (None, 40, 40, 128)  256         re_lu_60[0][0]                   
__________________________________________________________________________________________________
dropout_60 (Dropout)            (None, 40, 40, 128)  0           instance_normalization_60[0][0]  
__________________________________________________________________________________________________
conv2d_67 (Conv2D)              (None, 40, 40, 128)  147584      dropout_60[0][0]                 
__________________________________________________________________________________________________
re_lu_61 (ReLU)                 (None, 40, 40, 128)  0           conv2d_67[0][0]                  
__________________________________________________________________________________________________
instance_normalization_61 (Inst (None, 40, 40, 128)  256         re_lu_61[0][0]                   
__________________________________________________________________________________________________
dropout_61 (Dropout)            (None, 40, 40, 128)  0           instance_normalization_61[0][0]  
__________________________________________________________________________________________________
up_sampling2d_13 (UpSampling2D) (None, 80, 80, 128)  0           dropout_61[0][0]                 
__________________________________________________________________________________________________
concatenate_13 (Concatenate)    (None, 80, 80, 256)  0           dropout_56[0][0]                 
                                                                 up_sampling2d_13[0][0]           
__________________________________________________________________________________________________
conv2d_68 (Conv2D)              (None, 80, 80, 64)   147520      concatenate_13[0][0]             
__________________________________________________________________________________________________
re_lu_62 (ReLU)                 (None, 80, 80, 64)   0           conv2d_68[0][0]                  
__________________________________________________________________________________________________
instance_normalization_62 (Inst (None, 80, 80, 64)   128         re_lu_62[0][0]                   
__________________________________________________________________________________________________
dropout_62 (Dropout)            (None, 80, 80, 64)   0           instance_normalization_62[0][0]  
__________________________________________________________________________________________________
conv2d_69 (Conv2D)              (None, 80, 80, 64)   36928       dropout_62[0][0]                 
__________________________________________________________________________________________________
re_lu_63 (ReLU)                 (None, 80, 80, 64)   0           conv2d_69[0][0]                  
__________________________________________________________________________________________________
instance_normalization_63 (Inst (None, 80, 80, 64)   128         re_lu_63[0][0]                   
__________________________________________________________________________________________________
dropout_63 (Dropout)            (None, 80, 80, 64)   0           instance_normalization_63[0][0]  
__________________________________________________________________________________________________
up_sampling2d_14 (UpSampling2D) (None, 160, 160, 64) 0           dropout_63[0][0]                 
__________________________________________________________________________________________________
concatenate_14 (Concatenate)    (None, 160, 160, 128 0           dropout_54[0][0]                 
                                                                 up_sampling2d_14[0][0]           
__________________________________________________________________________________________________
conv2d_70 (Conv2D)              (None, 160, 160, 32) 36896       concatenate_14[0][0]             
__________________________________________________________________________________________________
re_lu_64 (ReLU)                 (None, 160, 160, 32) 0           conv2d_70[0][0]                  
__________________________________________________________________________________________________
instance_normalization_64 (Inst (None, 160, 160, 32) 64          re_lu_64[0][0]                   
__________________________________________________________________________________________________
dropout_64 (Dropout)            (None, 160, 160, 32) 0           instance_normalization_64[0][0]  
__________________________________________________________________________________________________
conv2d_71 (Conv2D)              (None, 160, 160, 32) 9248        dropout_64[0][0]                 
__________________________________________________________________________________________________
re_lu_65 (ReLU)                 (None, 160, 160, 32) 0           conv2d_71[0][0]                  
__________________________________________________________________________________________________
instance_normalization_65 (Inst (None, 160, 160, 32) 64          re_lu_65[0][0]                   
__________________________________________________________________________________________________
dropout_65 (Dropout)            (None, 160, 160, 32) 0           instance_normalization_65[0][0]  
__________________________________________________________________________________________________
up_sampling2d_15 (UpSampling2D) (None, 320, 320, 32) 0           dropout_65[0][0]                 
__________________________________________________________________________________________________
concatenate_15 (Concatenate)    (None, 320, 320, 64) 0           dropout_52[0][0]                 
                                                                 up_sampling2d_15[0][0]           
__________________________________________________________________________________________________
conv2d_72 (Conv2D)              (None, 320, 320, 32) 18464       concatenate_15[0][0]             
__________________________________________________________________________________________________
re_lu_66 (ReLU)                 (None, 320, 320, 32) 0           conv2d_72[0][0]                  
__________________________________________________________________________________________________
instance_normalization_66 (Inst (None, 320, 320, 32) 64          re_lu_66[0][0]                   
__________________________________________________________________________________________________
dropout_66 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_66[0][0]  
__________________________________________________________________________________________________
conv2d_73 (Conv2D)              (None, 320, 320, 32) 9248        dropout_66[0][0]                 
__________________________________________________________________________________________________
re_lu_67 (ReLU)                 (None, 320, 320, 32) 0           conv2d_73[0][0]                  
__________________________________________________________________________________________________
instance_normalization_67 (Inst (None, 320, 320, 32) 64          re_lu_67[0][0]                   
__________________________________________________________________________________________________
dropout_67 (Dropout)            (None, 320, 320, 32) 0           instance_normalization_67[0][0]  
__________________________________________________________________________________________________
conv2d_74 (Conv2D)              (None, 320, 320, 16) 528         dropout_67[0][0]                 
__________________________________________________________________________________________________
conv2d_75 (Conv2D)              (None, 320, 320, 1)  17          conv2d_74[0][0]                  
==================================================================================================
Total params: 2,761,601
Trainable params: 2,761,601
Non-trainable params: 0
__________________________________________________________________________________________________
