Model: "functional_11"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_12 (InputLayer)           [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_95 (Conv2D)              (None, 320, 320, 2)  20          input_12[0][0]                   
__________________________________________________________________________________________________
re_lu_85 (ReLU)                 (None, 320, 320, 2)  0           conv2d_95[0][0]                  
__________________________________________________________________________________________________
instance_normalization_85 (Inst (None, 320, 320, 2)  4           re_lu_85[0][0]                   
__________________________________________________________________________________________________
dropout_85 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_85[0][0]  
__________________________________________________________________________________________________
conv2d_96 (Conv2D)              (None, 320, 320, 2)  38          dropout_85[0][0]                 
__________________________________________________________________________________________________
re_lu_86 (ReLU)                 (None, 320, 320, 2)  0           conv2d_96[0][0]                  
__________________________________________________________________________________________________
instance_normalization_86 (Inst (None, 320, 320, 2)  4           re_lu_86[0][0]                   
__________________________________________________________________________________________________
dropout_86 (Dropout)            (None, 320, 320, 2)  0           instance_normalization_86[0][0]  
__________________________________________________________________________________________________
max_pooling2d_20 (MaxPooling2D) (None, 160, 160, 2)  0           dropout_86[0][0]                 
__________________________________________________________________________________________________
conv2d_97 (Conv2D)              (None, 160, 160, 4)  76          max_pooling2d_20[0][0]           
__________________________________________________________________________________________________
re_lu_87 (ReLU)                 (None, 160, 160, 4)  0           conv2d_97[0][0]                  
__________________________________________________________________________________________________
instance_normalization_87 (Inst (None, 160, 160, 4)  8           re_lu_87[0][0]                   
__________________________________________________________________________________________________
dropout_87 (Dropout)            (None, 160, 160, 4)  0           instance_normalization_87[0][0]  
__________________________________________________________________________________________________
conv2d_98 (Conv2D)              (None, 160, 160, 4)  148         dropout_87[0][0]                 
__________________________________________________________________________________________________
re_lu_88 (ReLU)                 (None, 160, 160, 4)  0           conv2d_98[0][0]                  
__________________________________________________________________________________________________
instance_normalization_88 (Inst (None, 160, 160, 4)  8           re_lu_88[0][0]                   
__________________________________________________________________________________________________
dropout_88 (Dropout)            (None, 160, 160, 4)  0           instance_normalization_88[0][0]  
__________________________________________________________________________________________________
max_pooling2d_21 (MaxPooling2D) (None, 80, 80, 4)    0           dropout_88[0][0]                 
__________________________________________________________________________________________________
conv2d_99 (Conv2D)              (None, 80, 80, 8)    296         max_pooling2d_21[0][0]           
__________________________________________________________________________________________________
re_lu_89 (ReLU)                 (None, 80, 80, 8)    0           conv2d_99[0][0]                  
__________________________________________________________________________________________________
instance_normalization_89 (Inst (None, 80, 80, 8)    16          re_lu_89[0][0]                   
__________________________________________________________________________________________________
dropout_89 (Dropout)            (None, 80, 80, 8)    0           instance_normalization_89[0][0]  
__________________________________________________________________________________________________
conv2d_100 (Conv2D)             (None, 80, 80, 8)    584         dropout_89[0][0]                 
__________________________________________________________________________________________________
re_lu_90 (ReLU)                 (None, 80, 80, 8)    0           conv2d_100[0][0]                 
__________________________________________________________________________________________________
instance_normalization_90 (Inst (None, 80, 80, 8)    16          re_lu_90[0][0]                   
__________________________________________________________________________________________________
dropout_90 (Dropout)            (None, 80, 80, 8)    0           instance_normalization_90[0][0]  
__________________________________________________________________________________________________
max_pooling2d_22 (MaxPooling2D) (None, 40, 40, 8)    0           dropout_90[0][0]                 
__________________________________________________________________________________________________
conv2d_101 (Conv2D)             (None, 40, 40, 16)   1168        max_pooling2d_22[0][0]           
__________________________________________________________________________________________________
re_lu_91 (ReLU)                 (None, 40, 40, 16)   0           conv2d_101[0][0]                 
__________________________________________________________________________________________________
instance_normalization_91 (Inst (None, 40, 40, 16)   32          re_lu_91[0][0]                   
__________________________________________________________________________________________________
dropout_91 (Dropout)            (None, 40, 40, 16)   0           instance_normalization_91[0][0]  
__________________________________________________________________________________________________
conv2d_102 (Conv2D)             (None, 40, 40, 16)   2320        dropout_91[0][0]                 
__________________________________________________________________________________________________
re_lu_92 (ReLU)                 (None, 40, 40, 16)   0           conv2d_102[0][0]                 
__________________________________________________________________________________________________
instance_normalization_92 (Inst (None, 40, 40, 16)   32          re_lu_92[0][0]                   
__________________________________________________________________________________________________
dropout_92 (Dropout)            (None, 40, 40, 16)   0           instance_normalization_92[0][0]  
__________________________________________________________________________________________________
max_pooling2d_23 (MaxPooling2D) (None, 20, 20, 16)   0           dropout_92[0][0]                 
__________________________________________________________________________________________________
conv2d_103 (Conv2D)             (None, 20, 20, 16)   2320        max_pooling2d_23[0][0]           
__________________________________________________________________________________________________
re_lu_93 (ReLU)                 (None, 20, 20, 16)   0           conv2d_103[0][0]                 
__________________________________________________________________________________________________
instance_normalization_93 (Inst (None, 20, 20, 16)   32          re_lu_93[0][0]                   
__________________________________________________________________________________________________
dropout_93 (Dropout)            (None, 20, 20, 16)   0           instance_normalization_93[0][0]  
__________________________________________________________________________________________________
up_sampling2d_20 (UpSampling2D) (None, 40, 40, 16)   0           dropout_93[0][0]                 
__________________________________________________________________________________________________
concatenate_20 (Concatenate)    (None, 40, 40, 32)   0           dropout_92[0][0]                 
                                                                 up_sampling2d_20[0][0]           
__________________________________________________________________________________________________
conv2d_104 (Conv2D)             (None, 40, 40, 8)    2312        concatenate_20[0][0]             
__________________________________________________________________________________________________
re_lu_94 (ReLU)                 (None, 40, 40, 8)    0           conv2d_104[0][0]                 
__________________________________________________________________________________________________
instance_normalization_94 (Inst (None, 40, 40, 8)    16          re_lu_94[0][0]                   
__________________________________________________________________________________________________
dropout_94 (Dropout)            (None, 40, 40, 8)    0           instance_normalization_94[0][0]  
__________________________________________________________________________________________________
conv2d_105 (Conv2D)             (None, 40, 40, 8)    584         dropout_94[0][0]                 
__________________________________________________________________________________________________
re_lu_95 (ReLU)                 (None, 40, 40, 8)    0           conv2d_105[0][0]                 
__________________________________________________________________________________________________
instance_normalization_95 (Inst (None, 40, 40, 8)    16          re_lu_95[0][0]                   
__________________________________________________________________________________________________
dropout_95 (Dropout)            (None, 40, 40, 8)    0           instance_normalization_95[0][0]  
__________________________________________________________________________________________________
up_sampling2d_21 (UpSampling2D) (None, 80, 80, 8)    0           dropout_95[0][0]                 
__________________________________________________________________________________________________
concatenate_21 (Concatenate)    (None, 80, 80, 16)   0           dropout_90[0][0]                 
                                                                 up_sampling2d_21[0][0]           
__________________________________________________________________________________________________
conv2d_106 (Conv2D)             (None, 80, 80, 4)    580         concatenate_21[0][0]             
__________________________________________________________________________________________________
re_lu_96 (ReLU)                 (None, 80, 80, 4)    0           conv2d_106[0][0]                 
__________________________________________________________________________________________________
instance_normalization_96 (Inst (None, 80, 80, 4)    8           re_lu_96[0][0]                   
__________________________________________________________________________________________________
dropout_96 (Dropout)            (None, 80, 80, 4)    0           instance_normalization_96[0][0]  
__________________________________________________________________________________________________
conv2d_107 (Conv2D)             (None, 80, 80, 4)    148         dropout_96[0][0]                 
__________________________________________________________________________________________________
re_lu_97 (ReLU)                 (None, 80, 80, 4)    0           conv2d_107[0][0]                 
__________________________________________________________________________________________________
instance_normalization_97 (Inst (None, 80, 80, 4)    8           re_lu_97[0][0]                   
__________________________________________________________________________________________________
dropout_97 (Dropout)            (None, 80, 80, 4)    0           instance_normalization_97[0][0]  
__________________________________________________________________________________________________
up_sampling2d_22 (UpSampling2D) (None, 160, 160, 4)  0           dropout_97[0][0]                 
__________________________________________________________________________________________________
concatenate_22 (Concatenate)    (None, 160, 160, 8)  0           dropout_88[0][0]                 
                                                                 up_sampling2d_22[0][0]           
__________________________________________________________________________________________________
conv2d_108 (Conv2D)             (None, 160, 160, 2)  146         concatenate_22[0][0]             
__________________________________________________________________________________________________
re_lu_98 (ReLU)                 (None, 160, 160, 2)  0           conv2d_108[0][0]                 
__________________________________________________________________________________________________
instance_normalization_98 (Inst (None, 160, 160, 2)  4           re_lu_98[0][0]                   
__________________________________________________________________________________________________
dropout_98 (Dropout)            (None, 160, 160, 2)  0           instance_normalization_98[0][0]  
__________________________________________________________________________________________________
conv2d_109 (Conv2D)             (None, 160, 160, 2)  38          dropout_98[0][0]                 
__________________________________________________________________________________________________
re_lu_99 (ReLU)                 (None, 160, 160, 2)  0           conv2d_109[0][0]                 
__________________________________________________________________________________________________
instance_normalization_99 (Inst (None, 160, 160, 2)  4           re_lu_99[0][0]                   
__________________________________________________________________________________________________
dropout_99 (Dropout)            (None, 160, 160, 2)  0           instance_normalization_99[0][0]  
__________________________________________________________________________________________________
up_sampling2d_23 (UpSampling2D) (None, 320, 320, 2)  0           dropout_99[0][0]                 
__________________________________________________________________________________________________
concatenate_23 (Concatenate)    (None, 320, 320, 4)  0           dropout_86[0][0]                 
                                                                 up_sampling2d_23[0][0]           
__________________________________________________________________________________________________
conv2d_110 (Conv2D)             (None, 320, 320, 2)  74          concatenate_23[0][0]             
__________________________________________________________________________________________________
re_lu_100 (ReLU)                (None, 320, 320, 2)  0           conv2d_110[0][0]                 
__________________________________________________________________________________________________
instance_normalization_100 (Ins (None, 320, 320, 2)  4           re_lu_100[0][0]                  
__________________________________________________________________________________________________
dropout_100 (Dropout)           (None, 320, 320, 2)  0           instance_normalization_100[0][0] 
__________________________________________________________________________________________________
conv2d_111 (Conv2D)             (None, 320, 320, 2)  38          dropout_100[0][0]                
__________________________________________________________________________________________________
re_lu_101 (ReLU)                (None, 320, 320, 2)  0           conv2d_111[0][0]                 
__________________________________________________________________________________________________
instance_normalization_101 (Ins (None, 320, 320, 2)  4           re_lu_101[0][0]                  
__________________________________________________________________________________________________
dropout_101 (Dropout)           (None, 320, 320, 2)  0           instance_normalization_101[0][0] 
__________________________________________________________________________________________________
conv2d_112 (Conv2D)             (None, 320, 320, 1)  3           dropout_101[0][0]                
__________________________________________________________________________________________________
conv2d_113 (Conv2D)             (None, 320, 320, 1)  2           conv2d_112[0][0]                 
==================================================================================================
Total params: 11,111
Trainable params: 11,111
Non-trainable params: 0
__________________________________________________________________________________________________
