Model: "functional_13"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_14 (InputLayer)           [(None, 320, 320, 1) 0                                            
__________________________________________________________________________________________________
conv2d_114 (Conv2D)             (None, 320, 320, 16) 160         input_14[0][0]                   
__________________________________________________________________________________________________
re_lu_102 (ReLU)                (None, 320, 320, 16) 0           conv2d_114[0][0]                 
__________________________________________________________________________________________________
instance_normalization_102 (Ins (None, 320, 320, 16) 32          re_lu_102[0][0]                  
__________________________________________________________________________________________________
dropout_102 (Dropout)           (None, 320, 320, 16) 0           instance_normalization_102[0][0] 
__________________________________________________________________________________________________
conv2d_115 (Conv2D)             (None, 320, 320, 16) 2320        dropout_102[0][0]                
__________________________________________________________________________________________________
re_lu_103 (ReLU)                (None, 320, 320, 16) 0           conv2d_115[0][0]                 
__________________________________________________________________________________________________
instance_normalization_103 (Ins (None, 320, 320, 16) 32          re_lu_103[0][0]                  
__________________________________________________________________________________________________
dropout_103 (Dropout)           (None, 320, 320, 16) 0           instance_normalization_103[0][0] 
__________________________________________________________________________________________________
max_pooling2d_24 (MaxPooling2D) (None, 160, 160, 16) 0           dropout_103[0][0]                
__________________________________________________________________________________________________
conv2d_116 (Conv2D)             (None, 160, 160, 32) 4640        max_pooling2d_24[0][0]           
__________________________________________________________________________________________________
re_lu_104 (ReLU)                (None, 160, 160, 32) 0           conv2d_116[0][0]                 
__________________________________________________________________________________________________
instance_normalization_104 (Ins (None, 160, 160, 32) 64          re_lu_104[0][0]                  
__________________________________________________________________________________________________
dropout_104 (Dropout)           (None, 160, 160, 32) 0           instance_normalization_104[0][0] 
__________________________________________________________________________________________________
conv2d_117 (Conv2D)             (None, 160, 160, 32) 9248        dropout_104[0][0]                
__________________________________________________________________________________________________
re_lu_105 (ReLU)                (None, 160, 160, 32) 0           conv2d_117[0][0]                 
__________________________________________________________________________________________________
instance_normalization_105 (Ins (None, 160, 160, 32) 64          re_lu_105[0][0]                  
__________________________________________________________________________________________________
dropout_105 (Dropout)           (None, 160, 160, 32) 0           instance_normalization_105[0][0] 
__________________________________________________________________________________________________
max_pooling2d_25 (MaxPooling2D) (None, 80, 80, 32)   0           dropout_105[0][0]                
__________________________________________________________________________________________________
conv2d_118 (Conv2D)             (None, 80, 80, 64)   18496       max_pooling2d_25[0][0]           
__________________________________________________________________________________________________
re_lu_106 (ReLU)                (None, 80, 80, 64)   0           conv2d_118[0][0]                 
__________________________________________________________________________________________________
instance_normalization_106 (Ins (None, 80, 80, 64)   128         re_lu_106[0][0]                  
__________________________________________________________________________________________________
dropout_106 (Dropout)           (None, 80, 80, 64)   0           instance_normalization_106[0][0] 
__________________________________________________________________________________________________
conv2d_119 (Conv2D)             (None, 80, 80, 64)   36928       dropout_106[0][0]                
__________________________________________________________________________________________________
re_lu_107 (ReLU)                (None, 80, 80, 64)   0           conv2d_119[0][0]                 
__________________________________________________________________________________________________
instance_normalization_107 (Ins (None, 80, 80, 64)   128         re_lu_107[0][0]                  
__________________________________________________________________________________________________
dropout_107 (Dropout)           (None, 80, 80, 64)   0           instance_normalization_107[0][0] 
__________________________________________________________________________________________________
max_pooling2d_26 (MaxPooling2D) (None, 40, 40, 64)   0           dropout_107[0][0]                
__________________________________________________________________________________________________
conv2d_120 (Conv2D)             (None, 40, 40, 128)  73856       max_pooling2d_26[0][0]           
__________________________________________________________________________________________________
re_lu_108 (ReLU)                (None, 40, 40, 128)  0           conv2d_120[0][0]                 
__________________________________________________________________________________________________
instance_normalization_108 (Ins (None, 40, 40, 128)  256         re_lu_108[0][0]                  
__________________________________________________________________________________________________
dropout_108 (Dropout)           (None, 40, 40, 128)  0           instance_normalization_108[0][0] 
__________________________________________________________________________________________________
conv2d_121 (Conv2D)             (None, 40, 40, 128)  147584      dropout_108[0][0]                
__________________________________________________________________________________________________
re_lu_109 (ReLU)                (None, 40, 40, 128)  0           conv2d_121[0][0]                 
__________________________________________________________________________________________________
instance_normalization_109 (Ins (None, 40, 40, 128)  256         re_lu_109[0][0]                  
__________________________________________________________________________________________________
dropout_109 (Dropout)           (None, 40, 40, 128)  0           instance_normalization_109[0][0] 
__________________________________________________________________________________________________
max_pooling2d_27 (MaxPooling2D) (None, 20, 20, 128)  0           dropout_109[0][0]                
__________________________________________________________________________________________________
conv2d_122 (Conv2D)             (None, 20, 20, 128)  147584      max_pooling2d_27[0][0]           
__________________________________________________________________________________________________
re_lu_110 (ReLU)                (None, 20, 20, 128)  0           conv2d_122[0][0]                 
__________________________________________________________________________________________________
instance_normalization_110 (Ins (None, 20, 20, 128)  256         re_lu_110[0][0]                  
__________________________________________________________________________________________________
dropout_110 (Dropout)           (None, 20, 20, 128)  0           instance_normalization_110[0][0] 
__________________________________________________________________________________________________
up_sampling2d_24 (UpSampling2D) (None, 40, 40, 128)  0           dropout_110[0][0]                
__________________________________________________________________________________________________
concatenate_24 (Concatenate)    (None, 40, 40, 256)  0           dropout_109[0][0]                
                                                                 up_sampling2d_24[0][0]           
__________________________________________________________________________________________________
conv2d_123 (Conv2D)             (None, 40, 40, 64)   147520      concatenate_24[0][0]             
__________________________________________________________________________________________________
re_lu_111 (ReLU)                (None, 40, 40, 64)   0           conv2d_123[0][0]                 
__________________________________________________________________________________________________
instance_normalization_111 (Ins (None, 40, 40, 64)   128         re_lu_111[0][0]                  
__________________________________________________________________________________________________
dropout_111 (Dropout)           (None, 40, 40, 64)   0           instance_normalization_111[0][0] 
__________________________________________________________________________________________________
conv2d_124 (Conv2D)             (None, 40, 40, 64)   36928       dropout_111[0][0]                
__________________________________________________________________________________________________
re_lu_112 (ReLU)                (None, 40, 40, 64)   0           conv2d_124[0][0]                 
__________________________________________________________________________________________________
instance_normalization_112 (Ins (None, 40, 40, 64)   128         re_lu_112[0][0]                  
__________________________________________________________________________________________________
dropout_112 (Dropout)           (None, 40, 40, 64)   0           instance_normalization_112[0][0] 
__________________________________________________________________________________________________
up_sampling2d_25 (UpSampling2D) (None, 80, 80, 64)   0           dropout_112[0][0]                
__________________________________________________________________________________________________
concatenate_25 (Concatenate)    (None, 80, 80, 128)  0           dropout_107[0][0]                
                                                                 up_sampling2d_25[0][0]           
__________________________________________________________________________________________________
conv2d_125 (Conv2D)             (None, 80, 80, 32)   36896       concatenate_25[0][0]             
__________________________________________________________________________________________________
re_lu_113 (ReLU)                (None, 80, 80, 32)   0           conv2d_125[0][0]                 
__________________________________________________________________________________________________
instance_normalization_113 (Ins (None, 80, 80, 32)   64          re_lu_113[0][0]                  
__________________________________________________________________________________________________
dropout_113 (Dropout)           (None, 80, 80, 32)   0           instance_normalization_113[0][0] 
__________________________________________________________________________________________________
conv2d_126 (Conv2D)             (None, 80, 80, 32)   9248        dropout_113[0][0]                
__________________________________________________________________________________________________
re_lu_114 (ReLU)                (None, 80, 80, 32)   0           conv2d_126[0][0]                 
__________________________________________________________________________________________________
instance_normalization_114 (Ins (None, 80, 80, 32)   64          re_lu_114[0][0]                  
__________________________________________________________________________________________________
dropout_114 (Dropout)           (None, 80, 80, 32)   0           instance_normalization_114[0][0] 
__________________________________________________________________________________________________
up_sampling2d_26 (UpSampling2D) (None, 160, 160, 32) 0           dropout_114[0][0]                
__________________________________________________________________________________________________
concatenate_26 (Concatenate)    (None, 160, 160, 64) 0           dropout_105[0][0]                
                                                                 up_sampling2d_26[0][0]           
__________________________________________________________________________________________________
conv2d_127 (Conv2D)             (None, 160, 160, 16) 9232        concatenate_26[0][0]             
__________________________________________________________________________________________________
re_lu_115 (ReLU)                (None, 160, 160, 16) 0           conv2d_127[0][0]                 
__________________________________________________________________________________________________
instance_normalization_115 (Ins (None, 160, 160, 16) 32          re_lu_115[0][0]                  
__________________________________________________________________________________________________
dropout_115 (Dropout)           (None, 160, 160, 16) 0           instance_normalization_115[0][0] 
__________________________________________________________________________________________________
conv2d_128 (Conv2D)             (None, 160, 160, 16) 2320        dropout_115[0][0]                
__________________________________________________________________________________________________
re_lu_116 (ReLU)                (None, 160, 160, 16) 0           conv2d_128[0][0]                 
__________________________________________________________________________________________________
instance_normalization_116 (Ins (None, 160, 160, 16) 32          re_lu_116[0][0]                  
__________________________________________________________________________________________________
dropout_116 (Dropout)           (None, 160, 160, 16) 0           instance_normalization_116[0][0] 
__________________________________________________________________________________________________
up_sampling2d_27 (UpSampling2D) (None, 320, 320, 16) 0           dropout_116[0][0]                
__________________________________________________________________________________________________
concatenate_27 (Concatenate)    (None, 320, 320, 32) 0           dropout_103[0][0]                
                                                                 up_sampling2d_27[0][0]           
__________________________________________________________________________________________________
conv2d_129 (Conv2D)             (None, 320, 320, 16) 4624        concatenate_27[0][0]             
__________________________________________________________________________________________________
re_lu_117 (ReLU)                (None, 320, 320, 16) 0           conv2d_129[0][0]                 
__________________________________________________________________________________________________
instance_normalization_117 (Ins (None, 320, 320, 16) 32          re_lu_117[0][0]                  
__________________________________________________________________________________________________
dropout_117 (Dropout)           (None, 320, 320, 16) 0           instance_normalization_117[0][0] 
__________________________________________________________________________________________________
conv2d_130 (Conv2D)             (None, 320, 320, 16) 2320        dropout_117[0][0]                
__________________________________________________________________________________________________
re_lu_118 (ReLU)                (None, 320, 320, 16) 0           conv2d_130[0][0]                 
__________________________________________________________________________________________________
instance_normalization_118 (Ins (None, 320, 320, 16) 32          re_lu_118[0][0]                  
__________________________________________________________________________________________________
dropout_118 (Dropout)           (None, 320, 320, 16) 0           instance_normalization_118[0][0] 
__________________________________________________________________________________________________
conv2d_131 (Conv2D)             (None, 320, 320, 8)  136         dropout_118[0][0]                
__________________________________________________________________________________________________
conv2d_132 (Conv2D)             (None, 320, 320, 1)  9           conv2d_131[0][0]                 
==================================================================================================
Total params: 691,777
Trainable params: 691,777
Non-trainable params: 0
__________________________________________________________________________________________________
